# -*- coding: utf-8 -*-

import pdb
import dataset
import pprint
import json
# import pathlib
import sys, copy
import traceback


# dskacc=# select * from jis_account_a;
#  id | code |          name
# ----+------+------------------------
#   1 | 1000 | 流動資産
#   2 | 2000 | 固定資産
#   3 | 3000 | 繰延資産
#   4 | 4000 | 流動負債
#   5 | 5000 | 固定負債
#   6 | 6000 | 法令上の引当金
#   7 | 7000 | 資本
#   8 | 8000 | 経常損益
#   9 | 9000 | 特別損益及び未処分損益
# (9 行)


#= JIS X0406-1984 勘定科目コード 大分類コード 1桁 ⇒ e-Tax 2019年版の勘定科目コード（BScode10_2019.xlsxとPLcode10_2019.xlsx）
#   JIS 拡張版: 1..9 A..Z a..z
#   e-Tax 2019年版の勘定科目コード（BScode10_2019.xlsxとPLcode10_2019.xlsx）: [ 業種コード, 科目分類コード, 大分類コード ]
#       業種コード      := (例) 一般商工業: "10"
#       勘定科目区分    := (例) 資産: "A"
#       大分類コード    :=() 例) 流動資産: "1"
#
# メモ
#   1.貸借対照表
#     負債の部
#         賞与引当金
#           従業員賞与の未払計上額。
#         退職給付引当金
#           退職給付債務見込額および年金資産の評価に基づき必要額を計上。
#         その他の引当金
#           商法第287条ノ２の引当金をその名称を付して処理する。
#         特別法上の引当金
#           金融先物取引責任準備金
#             金融先物取引法第82条の規定による準備金。
#           証券取引責任準備金
#             証券取引法第65条の2第7項において準用する同法第51条の規定による準備金。
#=

JIS_2_ETAX2019_A = { # depth = 0 1 2 3 := 10A1-00010
    "10" : {    # 一般商工業
        # 1桁コード       業種コード         科目分類コード,     ETax Aコード
        "1"         : { "industry" : "10", "category" : "A", "cd" : "1"},  # 流動資産 ⇒ 資産, 流動資産
        "2"         : { "industry" : "10", "category" : "A", "cd" : "2"},  # 固定資産 ⇒ 資産, 固定資産
        "3"         : { "industry" : "10", "category" : "A", "cd" : "3"},  # 繰延資産 ⇒ 資産, 繰延資産
        "4"         : { "industry" : "10", "category" : "B", "cd" : "1"},  # 流動負債 ⇒ 負債, 流動負債
        "5"         : { "industry" : "10", "category" : "B", "cd" : "2"},  # 固定負債 ⇒ 負債, 固定負債
        "6"         : { "industry" : "10", "category" : "B", "cd" : "2"},  # 法令上の引当金 ⇒ 負債, 固定負債 ※その他の引当金　特別法上の引当金
        "7"         : { "industry" : "10", "category" : "C", "cd" : "1"},  # 資本 ⇒ 純資産の部, 株主資本
        
        "8"         : { "industry" : "10", "category" : "D", "cd" : "1"},  # （旧：経常損益）経常収益 ⇒ 営業活動による収益
        "a"         : { "industry" : "10", "category" : "E", "cd" : "1"},  # （旧：経常損益）経常費用 ⇒ 営業活動による費用・売上原価
        "c"         : { "industry" : "10", "category" : "E", "cd" : "2"},  # （旧：経常損益）経常費用 ⇒ 販売費及び一般管理費
        
        "9"         : { "industry" : "10", "category" : "D", "cd" : "3"},  # （旧：特別損益及び未処分損益）特別利益及び未処分利益   ⇒ 特別損益
        "b"         : { "industry" : "10", "category" : "E", "cd" : "4"},  # （旧：特別損益及び未処分損益）特別費用及び未処分費用　 ⇒ 特別損失
    }
}


# dskacc=# select id, code, xcode, etax_code, name from jis_account_a order by xcode;
#  id | code | xcode | etax_code |          name
# ----+------+-------+-----------+------------------------
#   1 | 1000 | 1000  | 10A1      | 流動資産
#   2 | 2000 | 2000  | 10A2      | 固定資産
#   3 | 3000 | 3000  | 10A3      | 繰延資産
#   4 | 4000 | 4000  | 10B1      | 流動負債
#   5 | 5000 | 5000  | 10B2      | 固定負債
#   6 | 6000 | 6000  | 10B2      | 法令上の引当金
#   7 | 7000 | 7000  | 10C1      | 資本
#   8 | 8000 | 8000  | 10D1      | 経常収益
#   9 | 9000 | 9000  | 10D3      | 特別利益及び未処分利益
#  97 | 8000 | a000  | 10E1      | 経常費用1
#  98 | 9000 | b000  | 10E4      | 特別費用及び未処分費用
#  99 | 8000 | c000  | 10E2      | 経常費用2
# (12 行)

#= jis_account_a 2024.02.20 版
#   ! := 必須　Field
#   !! := key　Field
#   MADE := 非必須　Field, 従来アプリと互換性や管理しやすいために作成しているField　※関連データ修正する度に更新・チェックすること
#           尚、実際、同一データのMADE Fieldは複数の形式が存在し（例：code-n、code-s）、その選択は、データの利用目的やアプリに委ねる。
#   Unikue Fields: id, cd1 + cd2, code, xcode
#   備考: DB 上 Field Name は、互換性やTableの連結を保つためであり、変更はご慎重に検討の上、行うこと。
#=
JIS_2_ETAX2019_A_DATA = [ # depth = 0 1 2 3 := 10A1-00010
    #  !id        !industry              !code-1         !code-1      code-n          code-s            !etax-code-1    !etax-code-1  etax-code-s           !name                             note
    #  !! key !!  industry_code          part 1          part 2       MADE, num       MADE, ascii       part 1          part 2        MADE, str       
    # -------   ---------------------   -------------   ----------   --------------  ---------------   -------------   -----------   --------------------  -------------------------------   ----------------------------------    
    { "id": 1,  "industry_code": "10",  "cd1":   1,     "cd2":   0,  "code": 10000,  "xcode": "1000",  "etax_1": "A",  "etax_2": 1,  "etax_code": "10A1",  "name": "流動資産",                "note": "流動資産 ⇒ 資産, 流動資産" }, 
    { "id": 2,  "industry_code": "10",  "cd1":   2,     "cd2":   0,  "code": 20000,  "xcode": "2000",  "etax_1": "A",  "etax_2": 2,  "etax_code": "10A2",  "name": "固定資産",                "note": "固定資産 ⇒ 資産, 固定資産" }, 
    { "id": 3,  "industry_code": "10",  "cd1":   3,     "cd2":   0,  "code": 30000,  "xcode": "3000",  "etax_1": "A",  "etax_2": 3,  "etax_code": "10A3",  "name": "繰延資産",                "note": "繰延資産 ⇒ 資産, 繰延資産" }, 
    { "id": 4,  "industry_code": "10",  "cd1":   4,     "cd2":   0,  "code": 40000,  "xcode": "4000",  "etax_1": "B",  "etax_2": 1,  "etax_code": "10B1",  "name": "流動負債",                "note": "流動負債 ⇒ 負債, 流動負債" }, 
    { "id": 5,  "industry_code": "10",  "cd1":   5,     "cd2":   0,  "code": 50000,  "xcode": "5000",  "etax_1": "B",  "etax_2": 2,  "etax_code": "10B2",  "name": "固定負債",                "note": "固定負債 ⇒ 負債, 固定負債" }, 
    { "id": 6,  "industry_code": "10",  "cd1":   6,     "cd2":   0,  "code": 60000,  "xcode": "6000",  "etax_1": "B",  "etax_2": 2,  "etax_code": "10B2",  "name": "法令上の引当金",           "note": "法令上の引当金 ⇒ 負債, 固定負債 ※その他の引当金　特別法上の引当金" }, 
    { "id": 7,  "industry_code": "10",  "cd1":   7,     "cd2":   0,  "code": 70000,  "xcode": "7000",  "etax_1": "C",  "etax_2": 1,  "etax_code": "10C1",  "name": "資本",                    "note": "資本 ⇒ 純資産の部, 株主資本" }, 
    { "id": 8,  "industry_code": "10",  "cd1":   8,     "cd2":   0,  "code": 80000,  "xcode": "8000",  "etax_1": "D",  "etax_2": 1,  "etax_code": "10D1",  "name": "経常収益",                "note": "（旧：経常損益）経常収益 ⇒ 営業活動による収益" }, 
    { "id": 97, "industry_code": "10",  "cd1":   8,     "cd2":   1,  "code": 81000,  "xcode": "a000",  "etax_1": "E",  "etax_2": 1,  "etax_code": "10E1",  "name": "経常費用1",               "note": "（旧：経常損益）経常費用 ⇒ 営業活動による費用・売上原価" }, 
    { "id": 99, "industry_code": "10",  "cd1":   8,     "cd2":   2,  "code": 82000,  "xcode": "c000",  "etax_1": "E",  "etax_2": 2,  "etax_code": "10E2",  "name": "経常費用2",               "note": "（旧：経常損益）経常費用 ⇒ 販売費及び一般管理費" }, 
    { "id": 9,  "industry_code": "10",  "cd1":   9,     "cd2":   0,  "code": 90000,  "xcode": "9000",  "etax_1": "D",  "etax_2": 3,  "etax_code": "10D3",  "name": "特別利益及び未処分利益",   "note": "（旧：特別損益及び未処分損益）特別利益及び未処分利益 ⇒ 特別損益" }, 
    { "id": 98, "industry_code": "10",  "cd1":   9,     "cd2":   1,  "code": 91000,  "xcode": "b000",  "etax_1": "E",  "etax_2": 4,  "etax_code": "10E4",  "name": "特別費用及び未処分費用",   "note": "（旧：特別損益及び未処分損益）特別費用及び未処分費用 ⇒ 特別損失" },        
]


JIS_2_ETAX2019_B_DATA = [ # depth = 4 := 10A1.0-0010   
    #  !id        !jisacc_a_id      !code-1         !code-1      code-n            code-s            !etax-code-1    etax-code-s             !should_be_deducted          !name                              note
    #  !! key !!                    part 1          part 2       MADE, num         MADE, ascii       part 1          MADE, str       
    # -------   ------------------- -------------   ----------   --------------    ---------------   -------------   ---------------------   ---------------------------  --------------------------------  ----------------------------------                        
    { "id": 11,  "jisacc_a_id": 1,  "cd1":   1,     "cd2":   0,  "code": 10100,   "xcode": "1100",  "etax_1": 0,    "etax_code": "10A10",  "should_be_deducted": False, "name": "当座資産",                "note": ".現金及び預金.現金" },    
    { "id": 12,  "jisacc_a_id": 1,  "cd1":   2,     "cd2":   0,  "code": 10200,   "xcode": "1200",  "etax_1": 0,    "etax_code": "10A10",  "should_be_deducted": False, "name": "たな卸資産",              "note": ".商品" },
    { "id": 14,  "jisacc_a_id": 1,  "cd1":   4,     "cd2":   0,  "code": 10400,   "xcode": "1400",  "etax_1": 0,    "etax_code": "10A10",  "should_be_deducted": False, "name": "その他の流動資産",         "note": ".前渡金" },
    { "id": 21,  "jisacc_a_id": 2,  "cd1":   1,     "cd2":   0,  "code": 20100,   "xcode": "2100",  "etax_1": 1,    "etax_code": "10A21",  "should_be_deducted": False, "name": "有形固定資産",            "note": ".建物" },
    { "id": 23,  "jisacc_a_id": 2,  "cd1":   3,     "cd2":   0,  "code": 20300,   "xcode": "2300",  "etax_1": 2,    "etax_code": "10A22",  "should_be_deducted": False, "name": "無形固定資産",            "note": ".特許権" },
    { "id": 26,  "jisacc_a_id": 2,  "cd1":   6,     "cd2":   0,  "code": 20600,   "xcode": "2600",  "etax_1": 3,    "etax_code": "10A23",  "should_be_deducted": False, "name": "投資その他の資産",        "note": ".出資金" },
    { "id": 31,  "jisacc_a_id": 3,  "cd1":   1,     "cd2":   0,  "code": 30100,   "xcode": "3100",  "etax_1": 0,    "etax_code": "10A30",  "should_be_deducted": False, "name": "繰延資産",                "note": ".創立費" },
    { "id": 41,  "jisacc_a_id": 4,  "cd1":   1,     "cd2":   0,  "code": 40100,   "xcode": "4100",  "etax_1": 0,    "etax_code": "10B10",  "should_be_deducted": False, "name": "短期債務",                "note": ".買掛金" },
    { "id": 43,  "jisacc_a_id": 4,  "cd1":   3,     "cd2":   0,  "code": 40300,   "xcode": "4300",  "etax_1": 0,    "etax_code": "10B10",  "should_be_deducted": False, "name": "引当金(流動性のもの)",     "note": ".修繕引当金" },
    { "id": 45,  "jisacc_a_id": 4,  "cd1":   5,     "cd2":   0,  "code": 40500,   "xcode": "4500",  "etax_1": 0,    "etax_code": "10B10",  "should_be_deducted": False, "name": "その他の流動負債",        "note": ".未払金" },
    { "id": 51,  "jisacc_a_id": 5,  "cd1":   1,     "cd2":   0,  "code": 50100,   "xcode": "5100",  "etax_1": 0,    "etax_code": "10B20",  "should_be_deducted": False, "name": "長期債務",                "note": ".社債" },
    { "id": 53,  "jisacc_a_id": 5,  "cd1":   3,     "cd2":   0,  "code": 50300,   "xcode": "5300",  "etax_1": 0,    "etax_code": "10B20",  "should_be_deducted": False, "name": "引当金(固定性のもの)",     "note": ".修繕引当金" },
    { "id": 61,  "jisacc_a_id": 6,  "cd1":   1,     "cd2":   0,  "code": 60100,   "xcode": "6100",  "etax_1": 0,    "etax_code": "10B20",  "should_be_deducted": False, "name": "商法第287条ノ2の引当金",   "note": ".商法第287条ノ２の引当金をその名称を付して処理する。" },
    { "id": 62,  "jisacc_a_id": 6,  "cd1":   2,     "cd2":   0,  "code": 60200,   "xcode": "6200",  "etax_1": 0,    "etax_code": "10B20",  "should_be_deducted": False, "name": "特別法上の準備金・引当金", "note": ".金融先物取引責任準備金" },
    { "id": 71,  "jisacc_a_id": 7,  "cd1":   1,     "cd2":   0,  "code": 70100,   "xcode": "7100",  "etax_1": 0,    "etax_code": "10C10",  "should_be_deducted": False, "name": "資本",                    "note": ".資本金" },
    { "id": 72,  "jisacc_a_id": 7,  "cd1":   2,     "cd2":   0,  "code": 70200,   "xcode": "7200",  "etax_1": 0,    "etax_code": "10C10",  "should_be_deducted": False, "name": "法定準備金",              "note": ".法定準備金" },
    { "id": 73,  "jisacc_a_id": 7,  "cd1":   3,     "cd2":   0,  "code": 70300,   "xcode": "7300",  "etax_1": 0,    "etax_code": "10C10",  "should_be_deducted": False, "name": "その他の剰余金",           "note": ".その他の剰余金" },
    { "id": 81,  "jisacc_a_id": 8,  "cd1":   1,     "cd2":   0,  "code": 80100,   "xcode": "8100",  "etax_1": 0,    "etax_code": "10D10",  "should_be_deducted": False, "name": "売上高",                    "note": ".売上高" },
    { "id": 86,  "jisacc_a_id": 8,  "cd1":   6,     "cd2":   0,  "code": 80600,   "xcode": "8600",  "etax_1": 0,    "etax_code": "10D10",  "should_be_deducted": False, "name": "営業外収益",                "note": ".営業外収益" },
    { "id": 91,  "jisacc_a_id": 9,  "cd1":   1,     "cd2":   0,  "code": 90100,   "xcode": "9100",  "etax_1": 0,    "etax_code": "10D30",  "should_be_deducted": False, "name": "特別利益",                  "note": ".特別利益" },
    { "id": 99,  "jisacc_a_id": 9,  "cd1":   9,     "cd2":   0,  "code": 90900,   "xcode": "9900",  "etax_1": 0,    "etax_code": "10D30",  "should_be_deducted": False, "name": "当期未処分利益(又は当期未処理損失)", "note": ".当期未処分利益" },
    { "id": 82,  "jisacc_a_id": 97, "cd1":   2,     "cd2":   0,  "code": 81200,   "xcode": "a200",  "etax_1": 0,    "etax_code": "10E10",  "should_be_deducted": False, "name": "売上原価",                  "note": ".売上原価" },
    { "id": 92,  "jisacc_a_id": 98, "cd1":   2,     "cd2":   0,  "code": 91200,   "xcode": "b200",  "etax_1": 0,    "etax_code": "10E40",  "should_be_deducted": False, "name": "特別損失",                  "note": ".特別損失" },
    { "id": 98,  "jisacc_a_id": 98, "cd1":   8,     "cd2":   0,  "code": 91800,   "xcode": "b800",  "etax_1": 0,    "etax_code": "10E40",  "should_be_deducted": False, "name": "法人税及び住民税",          "note": ".法人税" },
    { "id": 83,  "jisacc_a_id": 99, "cd1":   3,     "cd2":   0,  "code": 82300,   "xcode": "c300",  "etax_1": 0,    "etax_code": "10E20",  "should_be_deducted": False, "name": "販売費及び一般管理費",      "note": ".広告宣伝費" },
    { "id": 88,  "jisacc_a_id": 99, "cd1":   8,     "cd2":   0,  "code": 82800,   "xcode": "c800",  "etax_1": 0,    "etax_code": "10E20",  "should_be_deducted": False, "name": "営業外費用",                "note": ".営業外費用" },
]

# dskacc=# select * from jis_account_c;
#  jisacc_b_id | id  | code |              name              | should_be_deducted
# -------------+-----+------+--------------------------------+--------------------
#           11 | 111 | 1110 | 現金及び預金                   | f
#           11 | 112 | 1120 | 受取手形                       | f
#           11 | 113 | 1130 | 売掛金                         | f
#           11 | 114 | 1140 | 有価証券                       | f
#           11 | 115 | 1150 | 自己株式                       | f
#           11 | 116 | 1160 | 親会社株式                     | f
#           12 | 121 | 1210 | 商品                           | f
#           12 | 122 | 1220 | 製品                           | f
#           12 | 123 | 1230 | 副産物及び作業くず             | f
#           99 | 997 | 9970 | 中間配当額                     | f
#           99 | 998 | 9980 | 中間配当に伴う利益準備金積立   | f
#           12 | 124 | 1240 | 半製品                         | f
#           12 | 125 | 1250 | 原材料                         | f
#           12 | 126 | 1260 | 仕掛品                         | f
#           12 | 127 | 1270 | 貯蔵品                         | f
#           14 | 141 | 1410 | 前渡金                         | f
#           14 | 142 | 1420 | 前払費用                       | f
#           14 | 143 | 1430 | 未収収益                       | f
#           14 | 144 | 1440 | 短期貸付金                     | f
#           14 | 145 | 1450 | 未収入金                       | f
#           14 | 146 | 1460 | 預け金                         | f
#           14 | 199 | 1990 | 貸倒引当金                     | t
#           21 | 212 | 2120 | 構築物                         | f
#           21 | 211 | 2110 | 建物                           | f
#           21 | 213 | 2130 | 機械及び装置                   | f
#           21 | 214 | 2140 | 船舶航空機                     | f
#           21 | 215 | 2150 | 車両運搬具                     | f
#           21 | 216 | 2160 | 工具器具備品                   | f
#           21 | 221 | 2210 | 土地                           | f
#           23 | 231 | 2310 | 営業権                         | f
#           23 | 232 | 2320 | 特許件                         | f
#           23 | 233 | 2330 | 借地権(地上権を含む)           | f
#           23 | 235 | 2350 | 商標権                         | f
#           23 | 236 | 2360 | 実用新案権                     | f
#           23 | 237 | 2370 | 意匠権                         | f
#           23 | 238 | 2380 | 鉱業権                         | f
#           23 | 239 | 2390 | 漁業権(入漁権を含む)           | f
#           23 | 241 | 2410 | 水利権                         | f
#           23 | 242 | 2420 | 電話加入権                     | f
#           23 | 243 | 2430 | 施設利用券                     | f
#           26 | 261 | 2610 | 投資有価証券                   | f
#           26 | 262 | 2620 | 出資金                         | f
#           26 | 263 | 2630 | 長期貸付金                     | f
#           26 | 271 | 2710 | 投資固定資産                   | f
#           26 | 281 | 2810 | 長期前払費用                   | f
#           31 | 311 | 3110 | 創立費                         | f
#           31 | 312 | 3120 | 開業費                         | f
#           31 | 313 | 3130 | 新株発行費                     | f
#           31 | 314 | 3140 | 社債発行費                     | f
#           31 | 315 | 3150 | 社債発行差金                   | f
#           31 | 316 | 3160 | 開発費                         | f
#           31 | 317 | 3170 | 試験研究費                     | f
#           31 | 318 | 3180 | 建設利息                       | f
#           41 | 412 | 4120 | 買掛金                         | f
#           41 | 413 | 4130 | 短期借入金                     | f
#           41 | 414 | 4140 | 未払金                         | f
#           41 | 415 | 4150 | 未払費用                       | f
#           41 | 416 | 4160 | 前受金                         | f
#           41 | 417 | 4170 | 預り金                         | f
#           41 | 421 | 4210 | 前受収益                       | f
#           43 | 431 | 4310 | 製品保証等引当                 | f
#           43 | 432 | 4320 | 売上割戻引当金                 | f
#           43 | 433 | 4330 | 景品費引当金                   | f
#           43 | 434 | 4340 | 返品調整引当金                 | f
#           43 | 435 | 4350 | 賞与引当金                     | f
#           43 | 437 | 4370 | 修繕引当金                     | f
#           43 | 438 | 4380 | 債務保証損失引当金             | f
#           43 | 439 | 4390 | 損害補償損失引当金             | f
#           45 | 451 | 4510 | 割賦販売繰延利益               | f
#           51 | 512 | 5120 | 転換社債                       | f
#           51 | 513 | 5130 | 新株引受権付社債               | f
#           51 | 511 | 5110 | 社債                           | f
#           51 | 514 | 5140 | 長期借入金                     | f
#           51 | 515 | 5150 | 長期未払い金                   | f
#           51 | 516 | 5160 | 長期預り金                     | f
#           53 | 532 | 5320 | 特別修繕引当金                 | f
#           53 | 531 | 5310 | 退職給与引当金                 | f
#           71 | 711 | 7110 | 資本金                         | f
#           71 | 712 | 7120 | 新株式申込証拠金               | f
#           71 | 713 | 7130 | 新株式払込金                   | f
#           72 | 721 | 7210 | 資本準備金                     | f
#           72 | 726 | 7260 | 利益準備金                     | f
#           73 | 731 | 7310 | その他の資本剰余金             | f
#           73 | 732 | 7320 | 任意積立金                     | f
#           73 | 733 | 7330 | 当期未処分利益                 | f
#           81 | 811 | 8110 | 売上高                         | f
#           81 | 812 | 8120 | 役務収益                       | f
#           82 | 821 | 8210 | 期首商品・製品たな卸高         | f
#           82 | 822 | 8220 | 当期仕入高                     | f
#           82 | 823 | 8230 | 当期製品製造原価               | f
#           82 | 824 | 8240 | 期末商品・製品たな卸高         | f
#           86 | 861 | 8610 | 受取利息および割引料           | f
#           86 | 862 | 8620 | 受取配当金                     | f
#           86 | 863 | 8630 | 有価証券売却益                 | f
#           86 | 864 | 8640 | 仕入割引                       | f
#           86 | 865 | 8650 | 投資不動産賃貸料               | f
#           86 | 879 | 8790 | 雑収入                         | f
#           88 | 881 | 8810 | 支払い利息及び割引料           | f
#           88 | 882 | 8820 | 社債利息                       | f
#           88 | 883 | 8830 | 創立費償却                     | f
#           88 | 884 | 8840 | 開業費償却                     | f
#           88 | 885 | 8850 | 新株発行費償却                 | f
#           88 | 886 | 8860 | 社債発行費償却                 | f
#           88 | 887 | 8870 | 社債発行差金償却               | f
#           88 | 888 | 8880 | 有価証券評価                   | f
#           88 | 889 | 8890 | 有価証券売却損                 | f
#           88 | 891 | 8910 | 売上割引                       | f
#           91 | 912 | 9120 | 固定資産売却益                 | f
#           88 | 899 | 8990 | 有価証券売却損                 | f
#           91 | 913 | 9130 | 前期損益修正益                 | f
#           92 | 921 | 9210 | 固定資産売却・除却損           | f
#           92 | 922 | 9220 | 投資有価証券売却損             | f
#           92 | 923 | 9230 | 前期損益修正損                 | f
#           92 | 924 | 9240 | 災害損失                       | f
#           98 | 981 | 9810 | 法人税                         | f
#           98 | 982 | 9820 | 法人税追徴金                   | f
#           98 | 983 | 9830 | 住民税                         | f
#           98 | 984 | 9840 | 住民税追徴金                   | f
#           99 | 991 | 9910 | 前期繰越利益(又は前期繰越損失) | f
#           99 | 992 | 9920 | 中間配当積立金取崩額           | f
#           99 | 993 | 9930 | 減債積立金取崩額               | f
#           99 | 994 | 9940 | 事業拡張積立金取崩額           | f
#           99 | 995 | 9950 | その他の特定目的積立金目的     | f
#           41 | 411 | 4110 | 支払手形                       | f
#           99 | 999 | 9990 | 当期未処分利益                 | t
#           61 | 610 | 6100 | 商法第287条ノ2の引当金         | f
#           62 | 620 | 6200 | 特別法上の準備金・引当金       | f
#           83 | 830 | 8300 | 販売費及び一般管理費           | f
# (128 行)


# dskacc=# select * from jis_account_d;
#  jisacc_c_id |  id  | code |                       name                       | should_be_deducted | level | etax_code
# -------------+------+------+--------------------------------------------------+--------------------+-------+-----------
#          213 | 2131 | 2131 | 機械及び装置                                     | f                  | D     |
#          213 | 2139 | 2139 | 機械及び装置原価償却累計額                       | t                  | D     |
#          214 | 2141 | 2141 | 船舶航空機                                       | f                  | D     |
#          214 | 2149 | 2149 | 船舶航空機原価償却累計額                         | t                  | D     |
#          215 | 2151 | 2151 | 車両運搬具                                       | f                  | D     |
#          216 | 2161 | 2161 | 工具器具備品                                     | f                  | D     |
#          216 | 2169 | 2169 | 工具器具備品原価償却累計額                       | t                  | D     |
#          221 | 2210 | 2210 | 土地                                             | f                  | C     |
#          221 | 2270 | 2270 | 建設仮勘定                                       | f                  | C     |
#          221 | 2290 | 2290 | 減価償却累計額                                   | t                  | C     |
#          231 | 2310 | 2310 | 営業権                                           | f                  | C     |
#          232 | 2320 | 2320 | 特許件                                           | f                  | C     |
#          233 | 2330 | 2330 | 借地権(地上権を含む)                             | f                  | C     |
#          235 | 2350 | 2350 | 商標権                                           | f                  | C     |
#          236 | 2360 | 2360 | 実用新案権                                       | f                  | C     |
#          237 | 2370 | 2370 | 意匠権                                           | f                  | C     |
#          238 | 2380 | 2380 | 鉱業権                                           | f                  | C     |
#          241 | 2410 | 2410 | 水利権                                           | f                  | C     |
#          242 | 2420 | 2420 | 電話加入権                                       | f                  | C     |
#          243 | 2430 | 2430 | 施設利用券                                       | f                  | C     |
#          261 | 2615 | 2615 | 子会社株式                                       | f                  | D     |
#          261 | 2616 | 2616 | その他の関係会社株式                             | f                  | D     |
#          261 | 2617 | 2617 | 子会社社債                                       | f                  | D     |
#          261 | 2618 | 2618 | その他の関係会社社債                             | f                  | D     |
#          262 | 2627 | 2627 | 子会社出資金                                     | f                  | D     |
#          262 | 2628 | 2628 | その他の関係会社出資金                           | f                  | D     |
#          263 | 2634 | 2634 | 株主及び役員長期貸付金                           | f                  | D     |
#          263 | 2635 | 2635 | 従業員長期貸付金                                 | f                  | D     |
#          263 | 2636 | 2636 | 子会社長期貸付金                                 | f                  | D     |
#          271 | 2711 | 2711 | 投資固定資産(関係会社のものを除く)               | f                  | D     |
#          271 | 2718 | 2718 | その他の関係会社投資固定資産                     | f                  | D     |
#          271 | 2719 | 2719 | 減価償却累計額                                   | t                  | D     |
#          311 | 3110 | 3110 | 創立費                                           | f                  | C     |
#          312 | 3120 | 3120 | 開業費                                           | f                  | C     |
#          313 | 3130 | 3130 | 新株発行費                                       | f                  | C     |
#          314 | 3140 | 3140 | 社債発行費                                       | f                  | C     |
#          315 | 3150 | 3150 | 社債発行差金                                     | f                  | C     |
#          316 | 3160 | 3160 | 開発費                                           | f                  | C     |
#          317 | 3170 | 3170 | 試験研究費                                       | f                  | C     |
#          318 | 3180 | 3180 | 建設利息                                         | f                  | C     |
#          411 | 4117 | 4117 | 子会社支払手形                                   | f                  | D     |
#          411 | 4118 | 4118 | その他の関係会社支払手形                         | f                  | D     |
#          412 | 4120 | 4120 | 買掛金                                           | f                  | C     |
#          414 | 4147 | 4147 | 未払法人税等                                     | f                  | D     |
#          414 | 4148 | 4148 | 未払事業税等                                     | f                  | D     |
#          415 | 4150 | 4150 | 未払費用                                         | f                  | C     |
#          416 | 4160 | 4160 | 前受金                                           | f                  | C     |
#          417 | 4170 | 4170 | 預り金                                           | f                  | C     |
#          421 | 4210 | 4210 | 前受収益                                         | f                  | C     |
#          431 | 4310 | 4310 | 製品保証等引当                                   | f                  | C     |
#          432 | 4320 | 4320 | 売上割戻引当金                                   | f                  | C     |
#          433 | 4330 | 4330 | 景品費引当金                                     | f                  | C     |
#          435 | 4350 | 4350 | 賞与引当金                                       | f                  | C     |
#          437 | 4370 | 4370 | 修繕引当金                                       | f                  | C     |
#          438 | 4380 | 4380 | 債務保証損失引当金                               | f                  | C     |
#          439 | 4390 | 4390 | 損害補償損失引当金                               | f                  | C     |
#          451 | 4510 | 4510 | 割賦販売繰延利益                                 | f                  | C     |
#          511 | 5110 | 5110 | 社債                                             | f                  | C     |
#          512 | 5120 | 5120 | 転換社債                                         | f                  | C     |
#          513 | 5130 | 5130 | 新株引受権付社債                                 | f                  | C     |
#          514 | 5147 | 5147 | 子会社長期借入金                                 | f                  | D     |
#          516 | 5160 | 5160 | 長期預り金                                       | f                  | C     |
#          531 | 5310 | 5310 | 退職給与引当金                                   | f                  | C     |
#          532 | 5320 | 5320 | 特別修繕引当金                                   | f                  | C     |
#          620 | 6200 | 6200 | 特別法上の準備金・引当金                         | f                  | B     |
#          711 | 7110 | 7110 | 資本金                                           | f                  | C     |
#          712 | 7120 | 7120 | 新株式申込証拠金                                 | f                  | C     |
#          713 | 7130 | 7130 | 新株式払込金                                     | f                  | C     |
#          721 | 7210 | 7210 | 資本準備金                                       | f                  | C     |
#          726 | 7260 | 7260 | 利益準備金                                       | f                  | C     |
#          731 | 7310 | 7310 | その他の資本剰余金                               | f                  | C     |
#          732 | 7321 | 7321 | 特別償却準備金                                   | f                  | D     |
#          732 | 7325 | 7325 | 減債積立金                                       | f                  | D     |
#          732 | 7326 | 7326 | 中間配当積立金                                   | f                  | D     |
#          732 | 7327 | 7327 | 配当平均積立金                                   | f                  | D     |
#          732 | 7328 | 7328 | 別途積立金                                       | f                  | D     |
#          732 | 7329 | 7329 | その他の任意積立金                               | f                  | D     |
#          733 | 7330 | 7330 | 当期未処分利益                                   | f                  | C     |
#          811 | 8119 | 8119 | 売上控除高                                       | t                  | D     |
#          812 | 8120 | 8120 | 役務収益                                         | f                  | C     |
#          821 | 8210 | 8210 | 期首商品・製品たな卸高                           | f                  | C     |
#          822 | 8221 | 8221 | 当期仕入高(仕入控除高を除く)                     | f                  | D     |
#          822 | 8229 | 8229 | 仕入控除高を除く                                 | t                  | D     |
#          823 | 8230 | 8230 | 当期製品製造原価                                 | f                  | C     |
#          823 | 8240 | 8240 | 期末商品・製品たな卸高                           | f                  | C     |
#          830 | 8300 | 8300 | 販売費及び一般管理費                             | f                  | B     |
#          861 | 8610 | 8610 | 受取利息および割引料                             | f                  | C     |
#          862 | 8620 | 8620 | 受取配当金                                       | f                  | C     |
#          863 | 8630 | 8630 | 有価証券売却益                                   | f                  | C     |
#          864 | 8640 | 8640 | 仕入割引                                         | f                  | C     |
#          865 | 8650 | 8650 | 投資不動産賃貸料                                 | f                  | C     |
#          879 | 8790 | 8790 | 雑収入                                           | f                  | C     |
#          882 | 8820 | 8820 | 社債利息                                         | f                  | C     |
#          883 | 8830 | 8830 | 創立費償却                                       | f                  | C     |
#          884 | 8840 | 8840 | 開業費償却                                       | f                  | C     |
#          885 | 8850 | 8850 | 新株発行費償却                                   | f                  | C     |
#          886 | 8860 | 8860 | 社債発行費償却                                   | f                  | C     |
#          887 | 8870 | 8870 | 社債発行差金償却                                 | f                  | C     |
#          888 | 8880 | 8880 | 有価証券評価                                     | f                  | C     |
#          889 | 8890 | 8890 | 有価証券売却損                                   | f                  | C     |
#          891 | 8910 | 8910 | 売上割引                                         | f                  | C     |
#          899 | 8990 | 8990 | 有価証券売却損                                   | f                  | C     |
#          912 | 9120 | 9120 | 固定資産売却益                                   | f                  | C     |
#          913 | 9130 | 9130 | 前期損益修正益                                   | f                  | C     |
#          921 | 9210 | 9210 | 固定資産売却・除却損                             | f                  | C     |
#          923 | 9230 | 9230 | 前期損益修正損                                   | f                  | C     |
#          924 | 9240 | 9240 | 災害損失                                         | f                  | C     |
#          981 | 9810 | 9810 | 法人税                                           | f                  | C     |
#          111 | 1112 | 1112 | 預金                                             | f                  | D     |
#          113 | 1131 | 1131 | 売掛金(関係会社のものを除く)                     | f                  | D     |
#          212 | 2129 | 2129 | 構築物原価償却累計額                             | t                  | D     |
#          215 | 2159 | 2159 | 車両運搬具原価償却累計額                         | t                  | D     |
#          239 | 2390 | 2390 | 漁業権(入漁権を含む)                             | f                  | C     |
#          261 | 2611 | 2611 | 投資有価証券(関係会社株式及び関係会社社債を除く) | f                  | D     |
#          262 | 2621 | 2621 | 出資金(関係会社のものを除く)                     | f                  | D     |
#          263 | 2631 | 2631 | 長期貸付金(従業員等及び関係会社のものを除く)     | f                  | D     |
#          263 | 2637 | 2637 | その他の関係会社長期貸付金                       | f                  | D     |
#          982 | 9820 | 9820 | 法人税追徴金                                     | f                  | C     |
#          983 | 9830 | 9830 | 住民税                                           | f                  | C     |
#          263 | 2638 | 2638 | 破産債権等                                       | f                  | D     |
#          263 | 2639 | 2638 | 貸倒引当金                                       | t                  | D     |
#          984 | 9840 | 9840 | 住民税追徴金                                     | f                  | C     |
#          991 | 9910 | 9910 | 前期繰越利益(又は前期繰越損失)                   | f                  | C     |
#          113 | 1139 | 1139 | 貸倒引当金                                       | t                  | D     |
#          114 | 1140 | 1140 | 有価証券                                         | f                  | C     |
#          992 | 9920 | 9920 | 中間配当積立金取崩額                             | f                  | C     |
#          993 | 9930 | 9930 | 減債積立金取崩額                                 | f                  | C     |
#          994 | 9940 | 9940 | 事業拡張積立金取崩額                             | f                  | C     |
#          995 | 9950 | 9950 | その他の特定目的積立金目的                       | f                  | C     |
#          997 | 9970 | 9970 | 中間配当額                                       | f                  | C     |
#          998 | 9980 | 9980 | 中間配当に伴う利益準備金積立                     | f                  | C     |
#          999 | 9990 | 9990 | 当期未処分利益                                   | t                  | C     |
#          115 | 1150 | 1150 | 自己株式                                         | f                  | C     |
#          116 | 1160 | 1160 | 親会社株式                                       | f                  | C     |
#          121 | 1210 | 1210 | 商品                                             | f                  | C     |
#          122 | 1220 | 1220 | 製品                                             | f                  | C     |
#          123 | 1230 | 1230 | 副産物及び作業くず                               | f                  | C     |
#          124 | 1240 | 1240 | 半製品                                           | f                  | C     |
#          125 | 1250 | 1250 | 原材料                                           | f                  | C     |
#          126 | 1260 | 1260 | 仕掛品                                           | f                  | C     |
#          127 | 1270 | 1270 | 貯蔵品                                           | f                  | C     |
#          141 | 1410 | 1410 | 前渡金                                           | f                  | C     |
#          142 | 1421 | 1421 | 前払費用(関係会社のものを除く)                   | f                  | D     |
#          142 | 1427 | 1427 | 子会社前払費用                                   | f                  | D     |
#          142 | 1428 | 1428 | その他の関係会社前払費用                         | f                  | D     |
#          143 | 1431 | 1431 | 未収収益                                         | f                  | D     |
#          143 | 1437 | 1437 | 子会社未収収益                                   | f                  | D     |
#          143 | 1438 | 1438 | その他の関係会社未収収益                         | f                  | D     |
#          144 | 1441 | 1441 | 短期貸付金 (従業員及び関係会社のものを除く)      | f                  | D     |
#          144 | 1444 | 1444 | 株主及び役員短期貸付金                           | f                  | D     |
#          144 | 1445 | 1445 | 従業員短期貸付金                                 | f                  | D     |
#          144 | 1446 | 1446 | 子会社短期貸付金                                 | f                  | D     |
#          144 | 1447 | 1447 | その他の関係会社短期貸付金                       | f                  | D     |
#          144 | 1449 | 1449 | 貸倒引当金                                       | t                  | D     |
#          145 | 1450 | 1450 | 未収入金                                         | f                  | C     |
#          146 | 1460 | 1460 | 預け金                                           | f                  | C     |
#          199 | 1990 | 1990 | 貸倒引当金                                       | t                  | C     |
#          271 | 2717 | 2717 | 子会社の関係会社投資固定資産                     | f                  | D     |
#          281 | 2810 | 2810 | 長期前払費用                                     | f                  | C     |
#          411 | 4111 | 4111 | 支払手形(関係会社のものを除く)                   | f                  | D     |
#          413 | 4130 | 4130 | 短期借入金                                       | f                  | C     |
#          434 | 4340 | 4340 | 返品調整引当金                                   | f                  | C     |
#          514 | 5141 | 5141 | 長期借入金(関係会社のものを除く)                 | f                  | D     |
#          514 | 5148 | 5148 | その他の関係会社長期借入金                       | f                  | D     |
#          515 | 5150 | 5150 | 長期未払い金                                     | f                  | C     |
#          610 | 6100 | 6100 | 商法第287条ノ2の引当金                           | f                  | B     |
#          732 | 7322 | 7322 | 価格変動準備金                                   | f                  | D     |
#          732 | 7323 | 7323 | 海外投資等損失準備金                             | f                  | D     |
#          111 | 1111 | 1111 | 現金                                             | f                  | D     |
#          112 | 1121 | 1121 | 受取手形(関係会社のものを除く)                   | f                  | D     |
#          112 | 1127 | 1127 | 子会社受取手形                                   | f                  | D     |
#          112 | 1128 | 1128 | その他の関係会社受取手形                         | f                  | D     |
#          112 | 1129 | 1129 | 貸倒引当金                                       | t                  | D     |
#          113 | 1137 | 1137 | 子会社売掛金                                     | f                  | D     |
#          113 | 1138 | 1138 | その他の関係会社売掛金                           | f                  | D     |
#          211 | 2111 | 2111 | 建物                                             | f                  | D     |
#          211 | 2119 | 2119 | 建物原価償却累計額                               | t                  | D     |
#          732 | 7324 | 7324 | 公害防止準備金                                   | f                  | D     |
#          811 | 8111 | 8111 | 売上高(売上控除高を除く)                         | f                  | D     |
#          881 | 8810 | 8810 | 支払い利息及び割引料                             | f                  | C     |
#          922 | 9220 | 9220 | 投資有価証券売却損                               | f                  | C     |
#          212 | 2121 | 2121 | 構築物                                           | f                  | D     |
# (182 行)


def makeJisA2EtaxField(db, industry, tableName, madeFlag):
    #= JIS_2_ETAX2019_A_DATA を jis_account_a に upsert する
    table = db[tableName]
    
    for record in JIS_2_ETAX2019_A_DATA:
        pprint.pprint(record)
        
        #= Do Some assert of Fields especially MADE Fields
        # 1) A code is nn000 ※2024.02.20 仮仕様
        assert(record["code"] % 1000 == 0)
        # 2) A xcode is "a000", length is 4
        assert(record["xcode"][:1] in "1234567890abcdefghijklmnopqrstuvwxyz")
        assert(record["xcode"][1:] == "000")
        assert(len(record["xcode"]) == 4)
        # 3) etax_code is industry_code + etax_1 + str(etax_2), length is 4
        assert(len(record["etax_code"]) == 4)
        assert(record["etax_code"][:3] == record["industry_code"] + record["etax_1"])
        assert(record["etax_code"][3:] == str(record["etax_2"]))
        # 4) TODO etax_code is exists in Table etax_account Field acc_code
        #    TODO id を etax_account Field jis_code に記入する ※2024.02.20 検討中: D時 のみ　か [A, B, C, D] すべてに記入するか
        #    dskacc=# select id, title_item, industry, depth, acc_cate, acc_code, etax_acc_ja from etax_account;
        #     id  | title_item | industry | depth | acc_cate | acc_code  |    etax_acc_ja
        #     ------+------------+----------+-------+----------+-----------+--------------------
        #         1 | t          | 10       |     0 | -        | -         | 貸借対照表
        #         2 | f          | 10       |     1 | -        | -         | 貸借対照表
        #         3 | f          | 10       |     1 | -        | -         | 貸借対照表
        #         4 | t          | 10       |     2 | A        | 10A000010 | 資産の部
        #         5 | t          | 10       |     3 | A1       | 10A100010 | 流動資産
        #         6 | f          | 10       |     4 | A1       | 10A100020 | 現金及び預金
        #         7 | f          | 10       |     4 | A1       | 10A100030 | 受取手形及び売掛金
        #         8 | f          | 10       |     5 | A1       | 10A100040 | 貸倒引当金
        
        record[ "made_flag" ] = madeFlag
        table.upsert(record, ['id'])
    #rof
    
    print("JIS_2_ETAX2019_A_DATA を jis_account_a に upsert した。")
 
 
 
def makeJisB2EtaxField(db, industry, tableName, madeFlag):
    #= JIS_2_ETAX2019_B_DATA を jis_account_b に upsert する
    table = db[tableName]
    
    for record in JIS_2_ETAX2019_B_DATA:
        print("record:")
        pprint.pprint(record)
        # pdb.set_trace()
        #= Do Some assert of Fields especially MADE Fields
        a_recs = list(db[ "jis_account_a" ].find( id = record[ "jisacc_a_id" ]))
        assert( len(a_recs) == 1 )
        a_rec = a_recs[0]
        print("parent A record:")
        pprint.pprint(a_rec)
        # 1) B code is nnn00 ※2024.02.20 仮仕様
        assert(record["code"] % 100 == 0)
        # 2) B xcode is "aa00", length is 4
        assert(record["xcode"][:1] in "1234567890abcdefghijklmnopqrstuvwxyz")
        assert(record["xcode"][1:2] in "1234567890abcdefghijklmnopqrstuvwxyz")
        assert(record["xcode"][2:] == "00")
        assert(len(record["xcode"]) == 4)
        # 3) etax_code is industry_code + etax_1 + str(etax_2), length is 5
        assert(len(record["etax_code"]) == 5)
        assert(record["etax_code"][:4] == a_rec["etax_code"])
        assert(record["etax_code"][4:] == str(record["etax_1"]))
        # 4) TODO etax_code is exists in Table etax_account Field acc_code
        #    TODO id を etax_account Field jis_code に記入する ※2024.02.20 検討中: D時 のみ　か [A, B, C, D] すべてに記入するか
        
        record[ "made_flag" ] = madeFlag
        table.upsert(record, ['id'])
    #rof
    
    print("JIS_2_ETAX2019_A_DATA を jis_account_b に upsert した。")    
    
    
def makeJisA2EtaxField_old(db, industry, tableName, madeFlag):
    # jis_account_a データを読み込む
    table = db[tableName]
    
    rows = table.all()
    
    for row in rows:
        pprint.pprint(row)  # OrderedDict([('id', 1), ('code', 1000), ('name', '流動資産')])
        
        xcode = row['xcode'] if row['xcode'] is not None else str(row['code'])
        mycode  = xcode[:1] # 1桁コード, 1..9 A..Z a..z 拡張版
        
        indusCodeDict = JIS_2_ETAX2019_A[industry]
        assert(indusCodeDict is not None)
        
        etaxCode = indusCodeDict[mycode]
        assert(etaxCode is not None)
        pprint.pprint(etaxCode)
      
        record = copy.deepcopy(row)
        record["xcode"] = xcode          # !! Str型の拡張版に変換
        record["etax_code"] = f'{etaxCode["industry"]}{etaxCode["category"]}{etaxCode["cd"]}' # e-Tax 2019年版の勘定科目コード
        record[ "made_flag" ] = madeFlag
        pprint.pprint(record)
        
        table.update(record, ['id'])
        
        #= 初期のみ実行: xcode a000 b000 作成
        # if mycode == "8":
        #     #= "9" （旧：経常損益）経常費用 レコードを作成する
        #     mycode  = "a"
        #     etaxCode = indusCodeDict[mycode]
        #     assert(etaxCode is not None)
        #     pprint.pprint(etaxCode)            
            
        #     record = copy.deepcopy(row)
        #     record["xcode"] = f'{mycode}000' # !! Str型の拡張版に変換
        #     record["etax_code"] = f'{etaxCode["industry"]}{etaxCode["category"]}{etaxCode["cd"]}' # e-Tax 2019年版の勘定科目コード
        #     record[ "made_flag" ] = madeFlag
            
        #     record["id"] = 97
        #     pprint.pprint(record)
        #     table.upsert(record, ['id', 'xcode'])
        # #fi
        # if mycode == "8":
        #     #= "9" （旧：経常損益）経常費用 レコードを作成する
        #     mycode  = "c"
        #     etaxCode = indusCodeDict[mycode]
        #     assert(etaxCode is not None)
        #     pprint.pprint(etaxCode)            
            
        #     record = copy.deepcopy(row)
        #     record["xcode"] = f'{mycode}000' # !! Str型の拡張版に変換
        #     record["etax_code"] = f'{etaxCode["industry"]}{etaxCode["category"]}{etaxCode["cd"]}' # e-Tax 2019年版の勘定科目コード
        #     record[ "made_flag" ] = madeFlag
            
        #     record["id"] = 99
        #     pprint.pprint(record)
        #     table.upsert(record, ['id', 'xcode'])
        # #fi
        # if mycode == "9":
        #     #= "9" （旧：特別損益及び未処分損益）
        #     mycode  = "b"
        #     etaxCode = indusCodeDict[mycode]
        #     assert(etaxCode is not None)
        #     pprint.pprint(etaxCode)            
            
        #     record = copy.deepcopy(row)
        #     record["xcode"] = f'{mycode}000' # !! Str型の拡張版に変換
        #     record["etax_code"] = f'{etaxCode["industry"]}{etaxCode["category"]}{etaxCode["cd"]}' # e-Tax 2019年版の勘定科目コード
        #     record[ "made_flag" ] = madeFlag
            
        #     record["id"] = 98
        #     pprint.pprint(record)
        #     table.upsert(record, ['id', 'xcode'])
        # #fi
                
    #rof
    

if __name__ == '__main__':
    # pdb.set_trace()
    argvs = sys.argv  # コマンドライン引数を格納したリストの取得
    argc = len(argvs)  # 引数の個数

    if argc != 5:
        print('Usage: \n python makeJisAccCode2EtaxField.py "Database Connecting String" "industry" "a | b | c | d" "Made Flag String"')
        print('E.g: \n python makeJisAccCode2EtaxField.py "postgresql://postgres:postgres@localhost:25432/dskacc" "10" "a" "2024.02.19"')
        exit(1)
    # fi

    dbConnStr = argvs[1]
    industry = argvs[2]
    tableFix = argvs[3]
    madeFlag = argvs[4]
    
    assert(tableFix in [ "a", "b", "c", "d" ])
    tableName  = f'jis_account_{tableFix}'

    # データベースに接続
    try:
        db = dataset.connect(dbConnStr)
    except Exception as e:
        print("Error: {0}".format(e))
        exit(1)
    # yrt

    # do main work
    try:
        if tableFix  == "a":
           makeJisA2EtaxField(db, industry, tableName, madeFlag)
        elif tableFix  == "b":
           makeJisB2EtaxField(db, industry, tableName, madeFlag)
        else:
            raise ValueError('invalid fix')
        #fi
    #ryt
        
       
       
    except Exception as e:
        traceback.print_exc()
        exit(1)
    # yrt

    exit(0)